using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Занятия
{
    class Program
    {
        static void Main(string[] args)
        {
            //Тут делаем сумму чисел. c задаём с клавиатуры
            //int c;
            //c = 22;
            //c = c + 5;
            //Console.WriteLine(c);
            //int a = 10;
            //int b = 20;
            Print();
            Console.ReadKey();
            && - И
               x== 5 || x==10
            if (x>=50 && x<=100 && y>50 && y < 60)
            {

            }
                //double b = 2.1;
                //double k = 2;
                //Console.WriteLine("Введите х");
                //double x = double.Parse(Console.ReadLine());

                //Console.WriteLine(k +"*" + x + " + " + b + " = " + k * x + b);
                //Console.ReadKey();
                //int result = a + b;

                //Console.WriteLine("Сложение " + a + " + " + b + " = " + result);
                //Console.ReadKey();
                //Console.WriteLine(a);
                //Console.WriteLine(result);



                //Написать код. Завести переменную sum типа double. Завести 5 переменных double. Сложить эти 5 переменных и сохранить их сумму в переменной sum.
                //Посчитать среднее этих 5 чисел (sum/кол-во, т.е. sum / 5.0)
                //Если Среднее больше первого числа, то вывести на экран строку "первое число меньше среднего"
                //Если Среднее меньше первого числа, то вывести на экран строку "первое число больше среднего"
                //Сумма оказывается больш

        }



        static void Print()
        {
            string str1 = "Hello ";
            string str2 = "World!";
            string res = str1 + str2;
            Console.WriteLine(res);
        }

    }
}
